app/controllers/listings_controller.rb

  def index
    @listings = if params[:search]
        Listing.all.where(state: params[:search])
---
SELECT "listings".* FROM "listings" WHERE "listings"."state" = ? LIMIT ?  [["state", "Nevada"], ["LIMIT", 1]]