app/controllers/listings_controller.rb

  def index
    @listings = Listing.all
---
SELECT "listings".* FROM "listings"

  def show
    @listing = Listing.find(params[:id])
---
SELECT "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create
    listing = Listing.create(listing_params)
---
INSERT INTO "listings" ("street_address", "city", "state", "zip_code", "price", "floors", "bedrooms", "bathrooms", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def edit
    @listing = Listing.find(params[:id])
---
SELECT "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def update
    listing = Listing.find(params[:id])
    listing.update(listing_params)
---
SELECT "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "listings" SET "bedrooms" = ?, "updated_at" = ? WHERE "listings"."id" = ?  [["bedrooms", 4], ["updated_at", "2019-12-02 21:25:12.451208"], ["id", 2]]

  def delete
    listing = Listing.find(params[:id])
    listing.destroy
---
SELECT "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT ?  [["id", 25], ["LIMIT", 1]]
DELETE FROM "listings" WHERE "listings"."id" = ?  [["id", 12]]