app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "wish_lists".* FROM "wish_lists" WHERE "wish_lists"."user_id" = ?  [["user_id", 4]]
---
    def wish_list
        @user = User.find(params[:id])
        @wish_list = WishList.find(user_id: @user.id)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "listings".* FROM "listings" WHERE "listings"."user_id" = ?  [["user_id", 4]]
---
    def my_listings
        @user = User.find(params[:id])
        @listings = Listing.all.where(user_id: @user.id)

INSERT INTO "users" ("first_name", "last_name", "username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
INSERT INTO "wish_lists" ("user_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["user_id", 8], ["created_at", "2019-12-05 21:41:41.429684"], ["updated_at", "2019-12-05 21:41:41.429684"]]
---
    def create
        user = User.new(user_params)
        if user.save
            WishList.create(user_id: user.id )

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$12$KPzxL.0DphdQiAH18muTg.WVyrSneCs6MvUyOVpwYpfaYzCyXflFK"], ["updated_at", "2019-12-04 16:11:21.383685"], ["id", 4]]
---
    def update
        user = User.find(params[:id])
        user.update(user_params)

SELECT "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "wish_lists" ("user_id", "listing_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 4], ["listing_id", 2], ["created_at", "2019-12-04 18:40:41.144501"], ["updated_at", "2019-12-04 18:40:41.144501"]]
---
    def add_to_wish_list
        user = session[:user_id]
        listing = Listing.find(params[:id])
        WishList.create(user_id: session[:user_id], listing_id: listing.id)

SELECT "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
DELETE FROM "listings" WHERE "listings"."id" = ?  [["id", 14]]
---
    def delete_listing
        listing = Listing.find(params[:id])
        listing.destroy