app/controllers/wish_list_items_controller.rb

SELECT "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "wish_lists".* FROM "wish_lists" WHERE "wish_lists"."user_id" = ?  [["user_id", 4]]
INSERT INTO "wish_list_items" ("wish_list_id", "listing_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["wish_list_id", 7], ["listing_id", 7], ["created_at", "2019-12-06 19:40:59.752014"], ["updated_at", "2019-12-06 19:40:59.752014"]]
---
    def add_to_wish_list
        if logged_in?
            listing = Listing.find(params[:id])
            wl_id = WishList.where(user_id: session[:user_id])
            new_wl_item = WishListItem.new(wish_list_id: wl_id[0].id ,listing_id: listing.id)
            if new_wl_item.save

SELECT "wish_lists".* FROM "wish_lists" WHERE "wish_lists"."user_id" = ?  [["user_id", 13]]
DELETE FROM "wish_list_items" WHERE "wish_list_items"."id" = ?  [["id", 19]]
SELECT "wish_list_items".* FROM "wish_list_items" WHERE "wish_list_items"."wish_list_id" = ? AND "wish_list_items"."listing_id" = ?  [["wish_list_id", 9], ["listing_id", 2]]
---
    def delete_wish_list_item
        wl_id = WishList.where(user_id: session[:user_id])[0].id
        WishListItem.where(wish_list_id: wl_id, listing_id: params[:id]).destroy_all