app/models/user.rb

    def favorites
        w = self.wish_list
        w.wish_list_items.map { |l| l.listing }
---
SELECT "wish_lists".* FROM "wish_lists" WHERE "wish_lists"."user_id" = ? LIMIT ?  [["user_id", 11], ["LIMIT", 1]]
SELECT "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "wish_list_items".* FROM "wish_list_items" WHERE "wish_list_items"."wish_list_id" = ?  [["wish_list_id", 7]]